{
  "book": "compute-webgpu",
  "date": "2024-08-22",
  "words": [
    {
      "word": "a series of",
      "meaning": "一連の、連続した",
      "example_sentences": [
        {
          "en": "The animation was created using a series of keyframes.",
          "ja": "アニメーションは一連のキーフレームを使用して作成されました。"
        },
        {
          "en": "The project involves a series of complex tasks that require careful planning.",
          "ja": "このプロジェクトには、慎重な計画を必要とする一連の複雑なタスクが含まれています。"
        }
      ]
    },
    {
      "word": "submit",
      "meaning": "提出する",
      "example_sentences": [
        {
          "en": "Please submit the final render by the end of the day.",
          "ja": "最終レンダリングを本日中に提出してください。"
        },
        {
          "en": "The team needs to submit the new model to the asset library.",
          "ja": "チームは新しいモデルをアセットライブラリに提出する必要があります。"
        }
      ]
    },
    {
      "word": "dispatch",
      "meaning": "送る、派遣する",
      "example_sentences": [
        {
          "en": "The server will dispatch the data to the client as soon as it’s ready.",
          "ja": "サーバーはデータが準備でき次第、クライアントに送信します。"
        },
        {
          "en": "We need to dispatch a technician to resolve the issue on-site.",
          "ja": "現地での問題解決のために技術者を派遣する必要があります。"
        }
      ]
    },
    {
      "word": "transfer",
      "meaning": "転送する、移す",
      "example_sentences": [
        {
          "en": "The data will be transferred from the server to the client during the synchronization process.",
          "ja": "データは同期プロセス中にサーバーからクライアントに転送されます。"
        },
        {
          "en": "The model was transferred to another software for further refinement.",
          "ja": "モデルはさらなる精錬のために別のソフトウェアに移されました。"
        }
      ]
    },
    {
      "word": "synchronizing",
      "meaning": "同期すること",
      "example_sentences": [
        {
          "en": "Synchronizing animations across different scenes can be challenging.",
          "ja": "異なるシーン間でアニメーションを同期することは難しい場合があります。"
        },
        {
          "en": "The tool is responsible for synchronizing the databases in real-time.",
          "ja": "このツールはリアルタイムでデータベースを同期する役割を果たします。"
        }
      ]
    },
    {
      "word": "specifically",
      "meaning": "特に、具体的に",
      "example_sentences": [
        {
          "en": "This shader was specifically designed for photorealistic rendering.",
          "ja": "このシェーダーは、フォトリアリスティックなレンダリングのために特別に設計されました。"
        },
        {
          "en": "The tool was developed specifically for game development workflows.",
          "ja": "このツールは、ゲーム開発のワークフローのために特別に開発されました。"
        }
      ]
    },
    {
      "word": "maintainable",
      "meaning": "保守しやすい、維持可能な",
      "example_sentences": [
        {
          "en": "Writing maintainable code is crucial for long-term project success.",
          "ja": "保守しやすいコードを書くことは、長期的なプロジェクトの成功に不可欠です。"
        },
        {
          "en": "The system's architecture needs to be maintainable to ensure future updates.",
          "ja": "システムのアーキテクチャは、将来のアップデートを確実にするために維持可能である必要があります。"
        }
      ]
    },
    {
      "word": "traditional",
      "meaning": "従来の、伝統的な",
      "example_sentences": [
        {
          "en": "Traditional rendering methods can be time-consuming compared to modern techniques.",
          "ja": "従来のレンダリング方法は、最新技術に比べて時間がかかる場合があります。"
        },
        {
          "en": "The design incorporates traditional elements with a modern twist.",
          "ja": "このデザインは、現代風のアレンジを加えた伝統的な要素を取り入れています。"
        }
      ]
    },
    {
      "word": "robust",
      "meaning": "強力な、頑丈な",
      "example_sentences": [
        {
          "en": "We need a robust solution to handle large volumes of data.",
          "ja": "大量のデータを処理するためには、強力なソリューションが必要です。"
        },
        {
          "en": "The engine is robust enough to manage complex simulations in real-time.",
          "ja": "このエンジンは、リアルタイムで複雑なシミュレーションを管理できるほど強力です。"
        }
      ]
    },
    {
      "word": "improve",
      "meaning": "改善する、向上させる",
      "example_sentences": [
        {
          "en": "We implemented new techniques to improve the rendering speed.",
          "ja": "レンダリング速度を向上させるために、新しい技術を実装しました。"
        },
        {
          "en": "The team is constantly working to improve the game's performance.",
          "ja": "チームは常にゲームのパフォーマンスを向上させるために取り組んでいます。"
        }
      ]
    }
  ]
}
