{
  "book": "wgpu-by-examples",
  "date": "2024-08-19",
  "words": [
    {
      "word": "decrease",
      "meaning": "減少させる、減る",
      "example_sentences": [
        {
          "en": "To decrease render times, reduce the polygon count of the model.",
          "ja": "レンダリング時間を短縮するために、モデルのポリゴン数を減らしてください。"
        },
        {
          "en": "The brightness was decreased to create a more moody atmosphere in the scene.",
          "ja": "シーンによりムードのある雰囲気を作り出すために、明るさが減少されました。"
        }
      ]
    },
    {
      "word": "perfect reflection",
      "meaning": "完全な反射",
      "example_sentences": [
        {
          "en": "A perfect reflection can be achieved by setting the roughness to zero.",
          "ja": "ラフネスをゼロに設定することで、完全な反射が得られます。"
        },
        {
          "en": "In realistic rendering, perfect reflections are rarely used as most surfaces have some roughness.",
          "ja": "リアリスティックなレンダリングでは、ほとんどの表面にラフネスがあるため、完全な反射はめったに使用されません。"
        }
      ]
    },
    {
      "word": "in mind",
      "meaning": "念頭に置いて、考慮して",
      "example_sentences": [
        {
          "en": "When adjusting the lighting, keep in mind the overall mood of the scene.",
          "ja": "照明を調整する際には、シーン全体のムードを念頭に置いてください。"
        },
        {
          "en": "With performance in mind, the team decided to optimize the texture resolution.",
          "ja": "パフォーマンスを念頭に置いて、チームはテクスチャの解像度を最適化することに決めました。"
        }
      ]
    },
    {
      "word": "hold",
      "meaning": "保持する、持つ",
      "example_sentences": [
        {
          "en": "Hold the shift key to lock the camera's position while adjusting the angle.",
          "ja": "角度を調整している間、カメラの位置をロックするにはシフトキーを押し続けます。"
        },
        {
          "en": "The shader will hold the current settings until changes are applied.",
          "ja": "シェーダーは、変更が適用されるまで現在の設定を保持します。"
        }
      ]
    },
    {
      "word": "contribution",
      "meaning": "貢献、寄与",
      "example_sentences": [
        {
          "en": "Lighting plays a significant contribution to the realism of a 3D scene.",
          "ja": "照明は、3Dシーンのリアリズムに大きく貢献します。"
        },
        {
          "en": "The artist's contribution was crucial in achieving the final look of the project.",
          "ja": "アーティストの貢献は、プロジェクトの最終的な外観を実現する上で非常に重要でした。"
        }
      ]
    },
    {
      "word": "primary",
      "meaning": "主要な、第一の",
      "example_sentences": [
        {
          "en": "The primary goal of the project was to create a photorealistic environment.",
          "ja": "このプロジェクトの主な目標は、フォトリアルな環境を作り出すことでした。"
        },
        {
          "en": "Lighting is one of the primary factors that affect the overall mood of a scene.",
          "ja": "照明は、シーン全体のムードに影響を与える主要な要因の一つです。"
        }
      ]
    },
    {
      "word": "drawback",
      "meaning": "欠点、短所",
      "example_sentences": [
        {
          "en": "One drawback of using high-resolution textures is the increased memory consumption.",
          "ja": "高解像度テクスチャを使用することの欠点の一つは、メモリ消費量の増加です。"
        },
        {
          "en": "The main drawback of this approach is the longer render time required.",
          "ja": "このアプローチの主な欠点は、より長いレンダリング時間が必要なことです。"
        }
      ]
    },
    {
      "word": "impact",
      "meaning": "影響、効果",
      "example_sentences": [
        {
          "en": "The new lighting setup had a significant impact on the overall atmosphere of the scene.",
          "ja": "新しい照明設定は、シーンの全体的な雰囲気に大きな影響を与えました。"
        },
        {
          "en": "The resolution of the textures can have a major impact on render quality.",
          "ja": "テクスチャの解像度は、レンダリング品質に大きな影響を与える可能性があります。"
        }
      ]
    },
    {
      "word": "to address",
      "meaning": "対処する、解決するために",
      "example_sentences": [
        {
          "en": "To address the performance issues, the team decided to optimize the shaders.",
          "ja": "パフォーマンスの問題に対処するために、チームはシェーダーを最適化することにしました。"
        },
        {
          "en": "Additional lighting was added to address the issue of underexposed areas in the render.",
          "ja": "レンダリングで露出不足の部分に対処するために、追加の照明が追加されました。"
        }
      ]
    },
    {
      "word": "unlike",
      "meaning": "〜とは異なり",
      "example_sentences": [
        {
          "en": "Unlike traditional rendering methods, real-time rendering allows for immediate feedback.",
          "ja": "従来のレンダリング方法とは異なり、リアルタイムレンダリングでは即時のフィードバックが得られます。"
        },
        {
          "en": "The new material is more durable, unlike the previous version which was prone to wear.",
          "ja": "新しいマテリアルは、前のバージョンとは異なり、耐久性が高くなっています。"
        }
      ]
    }
  ]
}
