{
  "book": "wgpu-by-examples",
  "date": "2024-08-18",
  "words": [
    {
      "word": "efficiently",
      "meaning": "効率的に",
      "example_sentences": [
        {
          "en": "The new algorithm processes complex scenes more efficiently.",
          "ja": "新しいアルゴリズムは複雑なシーンをより効率的に処理します。"
        },
        {
          "en": "Organizing assets in folders helps work more efficiently on large projects.",
          "ja": "アセットをフォルダに整理することで、大規模なプロジェクトでの作業がより効率的になります。"
        }
      ]
    },
    {
      "word": "avoid",
      "meaning": "避ける",
      "example_sentences": [
        {
          "en": "To avoid errors, always check the file paths before rendering.",
          "ja": "エラーを避けるために、レンダリング前に必ずファイルパスを確認してください。"
        },
        {
          "en": "Avoid using too many lights in a scene, as this can slow down rendering.",
          "ja": "シーン内でライトを使いすぎることは、レンダリングを遅くする可能性があるため避けてください。"
        }
      ]
    },
    {
      "word": "afterward",
      "meaning": "その後",
      "example_sentences": [
        {
          "en": "Render the base model first, then add textures afterward.",
          "ja": "最初にベースモデルをレンダリングし、その後テクスチャを追加します。"
        },
        {
          "en": "The team finalized the design and began animating afterward.",
          "ja": "チームはデザインを最終決定し、その後アニメーションを開始しました。"
        }
      ]
    },
    {
      "word": "produce",
      "meaning": "生産する、作り出す",
      "example_sentences": [
        {
          "en": "The software can produce high-quality renders in a short time.",
          "ja": "このソフトウェアは短時間で高品質のレンダリングを作り出すことができます。"
        },
        {
          "en": "The studio was able to produce a full animation within six months.",
          "ja": "スタジオは、6か月以内にフルアニメーションを作り出すことができました。"
        }
      ]
    },
    {
      "word": "demonstrate",
      "meaning": "実演する、証明する",
      "example_sentences": [
        {
          "en": "The presentation will demonstrate how the new feature improves workflow.",
          "ja": "プレゼンテーションでは、新機能がワークフローをどのように改善するかを実演します。"
        },
        {
          "en": "The tutorial demonstrates the steps to create a realistic water effect.",
          "ja": "チュートリアルでは、リアルな水のエフェクトを作成する手順を実演しています。"
        }
      ]
    },
    {
      "word": "outcome",
      "meaning": "結果、成果",
      "example_sentences": [
        {
          "en": "The outcome of the project was a highly detailed 3D environment.",
          "ja": "プロジェクトの成果は、非常に詳細な3D環境でした。"
        },
        {
          "en": "The final outcome depended heavily on the lighting and shading techniques used.",
          "ja": "最終結果は、使用された照明とシェーディング技術に大きく依存していました。"
        }
      ]
    },
    {
      "word": "examine",
      "meaning": "調べる、検証する",
      "example_sentences": [
        {
          "en": "Examine the wireframe view to ensure the model has clean topology.",
          "ja": "モデルがクリーンなトポロジーを持っていることを確認するために、ワイヤーフレームビューを調べてください。"
        },
        {
          "en": "The developers examined the code to identify any potential bugs.",
          "ja": "開発者は潜在的なバグを特定するためにコードを調べました。"
        }
      ]
    },
    {
      "word": "solely",
      "meaning": "単独で、ただ〜だけ",
      "example_sentences": [
        {
          "en": "The project was completed solely by the lead artist.",
          "ja": "プロジェクトはリードアーティストによって単独で完成されました。"
        },
        {
          "en": "This tool is designed solely for texture mapping.",
          "ja": "このツールは、テクスチャマッピング専用に設計されています。"
        }
      ]
    },
    {
      "word": "viable",
      "meaning": "実行可能な、成功しそうな",
      "example_sentences": [
        {
          "en": "Real-time rendering is becoming a viable option for complex scenes.",
          "ja": "リアルタイムレンダリングは、複雑なシーンに対して実行可能な選択肢になりつつあります。"
        },
        {
          "en": "The team is exploring viable alternatives to reduce production costs.",
          "ja": "チームは、制作コストを削減するための実行可能な代替案を模索しています。"
        }
      ]
    },
    {
      "word": "nonetheless",
      "meaning": "それにもかかわらず",
      "example_sentences": [
        {
          "en": "The render took longer than expected, but the result was impressive nonetheless.",
          "ja": "レンダリングには予想以上に時間がかかりましたが、それにもかかわらず結果は見事でした。"
        },
        {
          "en": "The model had some flaws; nonetheless, it was approved for use in the final scene.",
          "ja": "モデルにはいくつかの欠点がありましたが、それにもかかわらず最終シーンでの使用が承認されました。"
        }
      ]
    }
  ]
}
