{
  "book": "compute-webgpu",
  "date": "2024-08-21",
  "words": [
    {
      "word": "excel",
      "meaning": "優れる、卓越する",
      "example_sentences": [
        {
          "en": "This software excels in rendering complex scenes quickly and efficiently.",
          "ja": "このソフトウェアは、複雑なシーンを迅速かつ効率的にレンダリングすることに優れています。"
        },
        {
          "en": "She excels at creating realistic textures that enhance the overall quality of the 3D model.",
          "ja": "彼女は、3Dモデルの全体的な品質を向上させるリアルなテクスチャの作成に優れています。"
        }
      ]
    },
    {
      "word": "perform",
      "meaning": "実行する、行う",
      "example_sentences": [
        {
          "en": "The system performs well even under heavy workloads, making it reliable for large projects.",
          "ja": "このシステムは、大規模なプロジェクトでも重い負荷の下でよく動作するため、信頼性があります。"
        },
        {
          "en": "The script performs a series of calculations to generate the desired output.",
          "ja": "スクリプトは、一連の計算を実行して、希望する出力を生成します。"
        }
      ]
    },
    {
      "word": "ideal",
      "meaning": "理想的な、最適な",
      "example_sentences": [
        {
          "en": "This material is ideal for creating reflective surfaces in 3D renders.",
          "ja": "このマテリアルは、3Dレンダリングで反射面を作成するのに理想的です。"
        },
        {
          "en": "The software is ideal for beginners because of its intuitive interface.",
          "ja": "このソフトウェアは、直感的なインターフェイスのおかげで初心者に最適です。"
        }
      ]
    },
    {
      "word": "suitable",
      "meaning": "適した、適切な",
      "example_sentences": [
        {
          "en": "This shader is suitable for simulating realistic water surfaces.",
          "ja": "このシェーダーは、リアルな水面のシミュレーションに適しています。"
        },
        {
          "en": "The software is suitable for both high-end and low-end systems.",
          "ja": "このソフトウェアは、ハイエンドシステムとローエンドシステムの両方に適しています。"
        }
      ]
    },
    {
      "word": "though",
      "meaning": "〜だけれども、しかし",
      "example_sentences": [
        {
          "en": "The render time was longer than expected, though the final result was impressive.",
          "ja": "レンダリング時間は予想よりも長かったが、最終結果は見事でした。"
        },
        {
          "en": "Though the software is powerful, it has a steep learning curve.",
          "ja": "このソフトウェアは強力ですが、習得には時間がかかります。"
        }
      ]
    },
    {
      "word": "heavy",
      "meaning": "重い、負荷の高い",
      "example_sentences": [
        {
          "en": "Heavy textures and complex shaders can significantly increase render times.",
          "ja": "重いテクスチャと複雑なシェーダーは、レンダリング時間を大幅に増加させる可能性があります。"
        },
        {
          "en": "The system struggled under the heavy load of processing multiple high-resolution images.",
          "ja": "システムは、複数の高解像度画像を処理する重い負荷に苦労しました。"
        }
      ]
    },
    {
      "word": "branching",
      "meaning": "分岐、分岐すること",
      "example_sentences": [
        {
          "en": "Branching logic in shaders can create complex visual effects but may also slow down rendering.",
          "ja": "シェーダーの分岐ロジックは、複雑な視覚効果を生み出すことができますが、レンダリングを遅くする可能性もあります。"
        },
        {
          "en": "Branching in code requires careful handling to avoid performance issues.",
          "ja": "コードの分岐は、パフォーマンスの問題を避けるために慎重に扱う必要があります。"
        }
      ]
    },
    {
      "word": "inherently",
      "meaning": "本質的に、もともと",
      "example_sentences": [
        {
          "en": "Ray tracing is inherently more accurate but also more computationally expensive.",
          "ja": "レイトレーシングは本質的により正確ですが、計算コストが高くなります。"
        },
        {
          "en": "The material is inherently reflective, making it ideal for creating shiny surfaces.",
          "ja": "このマテリアルは本質的に反射性があるため、光沢のある表面を作成するのに理想的です。"
        }
      ]
    },
    {
      "word": "sequential",
      "meaning": "順次の、連続的な",
      "example_sentences": [
        {
          "en": "The rendering process is often sequential, requiring each frame to be processed one after another.",
          "ja": "レンダリングプロセスは通常、各フレームを順次処理する必要があります。"
        },
        {
          "en": "In sequential execution, tasks are completed in a specific order, one at a time.",
          "ja": "順次実行では、タスクは特定の順序で1つずつ完了します。"
        }
      ]
    },
    {
      "word": "offload",
      "meaning": "転送する、負担を軽減する",
      "example_sentences": [
        {
          "en": "The rendering tasks were offloaded to the GPU to free up the CPU for other operations.",
          "ja": "レンダリングタスクは、他の操作のためにCPUの負担を軽減するためにGPUに転送されました。"
        },
        {
          "en": "Offloading heavy computations to a dedicated processor can significantly improve performance.",
          "ja": "負荷の高い計算を専用プロセッサに転送することで、パフォーマンスが大幅に向上します。"
        }
      ]
    }
  ]
}
