{
  "book": "wgpu-by-examples",
  "date": "2024-08-19",
  "words": [
    {
      "word": "explain",
      "meaning": "説明する",
      "example_sentences": [
        {
          "en": "The instructor took time to explain the basics of 3D modeling to the beginners.",
          "ja": "インストラクターは初心者に3Dモデリングの基本を説明するための時間を取りました。"
        },
        {
          "en": "Could you explain how the lighting setup affects the overall scene?",
          "ja": "照明設定が全体のシーンにどのように影響するか説明してもらえますか？"
        }
      ]
    },
    {
      "word": "aspect",
      "meaning": "側面、局面",
      "example_sentences": [
        {
          "en": "One important aspect of rendering is ensuring the correct lighting for the scene.",
          "ja": "レンダリングの重要な側面の一つは、シーンに適した照明を確保することです。"
        },
        {
          "en": "Every aspect of the 3D model, from texture to shading, contributes to its realism.",
          "ja": "テクスチャからシェーディングまで、3Dモデルのすべての側面がリアリズムに寄与しています。"
        }
      ]
    },
    {
      "word": "uniformly",
      "meaning": "均一に、一様に",
      "example_sentences": [
        {
          "en": "The light was uniformly distributed across the scene to avoid harsh shadows.",
          "ja": "厳しい影を避けるために、光がシーン全体に均一に分散されました。"
        },
        {
          "en": "Apply the texture uniformly to ensure there are no visible seams.",
          "ja": "目に見える継ぎ目がないように、テクスチャを均一に適用してください。"
        }
      ]
    },
    {
      "word": "illuminate",
      "meaning": "照らす、照明を当てる",
      "example_sentences": [
        {
          "en": "The spotlight was used to illuminate the main subject in the scene.",
          "ja": "シーンのメインの被写体を照らすためにスポットライトが使用されました。"
        },
        {
          "en": "Properly placed lights can illuminate areas that would otherwise remain in shadow.",
          "ja": "適切に配置されたライトは、影のまま残るエリアを照らすことができます。"
        }
      ]
    },
    {
      "word": "regardless",
      "meaning": "〜に関わらず",
      "example_sentences": [
        {
          "en": "The render quality remained high regardless of the scene's complexity.",
          "ja": "シーンの複雑さに関わらず、レンダリングの品質は高いままでした。"
        },
        {
          "en": "Regardless of the texture resolution, the material applied seamlessly to the model.",
          "ja": "テクスチャの解像度に関わらず、マテリアルはモデルにシームレスに適用されました。"
        }
      ]
    },
    {
      "word": "illumination",
      "meaning": "照明、照らし",
      "example_sentences": [
        {
          "en": "Global illumination was enabled to achieve more realistic lighting effects.",
          "ja": "よりリアルな照明効果を得るためにグローバルイルミネーションが有効にされました。"
        },
        {
          "en": "The scene's illumination was adjusted to highlight the important elements.",
          "ja": "シーンの照明は、重要な要素を際立たせるために調整されました。"
        }
      ]
    },
    {
      "word": "incidence",
      "meaning": "入射、発生",
      "example_sentences": [
        {
          "en": "The angle of light incidence affects how shadows are cast in the scene.",
          "ja": "光の入射角は、シーン内での影の落ち方に影響を与えます。"
        },
        {
          "en": "Adjusting the incidence angle of the light can change the way the surface reflects it.",
          "ja": "光の入射角を調整すると、表面が光を反射する方法が変わります。"
        }
      ]
    },
    {
      "word": "reflective",
      "meaning": "反射性のある、反射する",
      "example_sentences": [
        {
          "en": "The reflective surface of the material created realistic reflections of the surroundings.",
          "ja": "マテリアルの反射性のある表面は、周囲のリアルな反射を作り出しました。"
        },
        {
          "en": "Adjust the reflective properties of the object to achieve the desired effect.",
          "ja": "希望する効果を得るために、オブジェクトの反射特性を調整してください。"
        }
      ]
    },
    {
      "word": "matte",
      "meaning": "つや消しの、マットな",
      "example_sentences": [
        {
          "en": "The material was given a matte finish to avoid any unwanted reflections.",
          "ja": "不要な反射を避けるために、マテリアルにはつや消し仕上げが施されました。"
        },
        {
          "en": "Matte surfaces are often used in scenes where reflections would be distracting.",
          "ja": "反射が気になるシーンでは、マットな表面がよく使用されます。"
        }
      ]
    },
    {
      "word": "terrain",
      "meaning": "地形、地勢",
      "example_sentences": [
        {
          "en": "The 3D model included detailed terrain to simulate a mountainous environment.",
          "ja": "3Dモデルには、山岳環境をシミュレートするための詳細な地形が含まれていました。"
        },
        {
          "en": "Creating realistic terrain requires careful attention to texture and elevation.",
          "ja": "リアルな地形を作成するには、テクスチャと標高に注意を払う必要があります。"
        }
      ]
    }
  ]
}
