{
  "book": "wgpu-by-examples",
  "date": "2024-08-18",
  "words": [
    {
      "word": "fully far",
      "meaning": "完全に遠くに",
      "example_sentences": [
        {
          "en": "The camera is positioned fully far from the scene to capture a wide-angle view.",
          "ja": "カメラは、広角ビューを撮影するためにシーンから完全に遠くに配置されています。"
        },
        {
          "en": "The light source is placed fully far from the object to create softer shadows.",
          "ja": "光源は、より柔らかい影を作るためにオブジェクトから完全に遠くに配置されています。"
        }
      ]
    },
    {
      "word": "consider",
      "meaning": "考慮する",
      "example_sentences": [
        {
          "en": "When designing a scene, consider the impact of lighting on mood.",
          "ja": "シーンをデザインする際は、照明がムードに与える影響を考慮してください。"
        },
        {
          "en": "You should consider using procedural textures for easier scalability.",
          "ja": "スケーラビリティを容易にするために、プロシージャルテクスチャの使用を考慮すべきです。"
        }
      ]
    },
    {
      "word": "effectively",
      "meaning": "効果的に",
      "example_sentences": [
        {
          "en": "Use LOD (Level of Detail) models to effectively manage performance.",
          "ja": "パフォーマンスを効果的に管理するために、LOD（レベル・オブ・ディテール）モデルを使用してください。"
        },
        {
          "en": "The new algorithm effectively reduces noise in the final render.",
          "ja": "新しいアルゴリズムは、最終レンダリングでノイズを効果的に減らします。"
        }
      ]
    },
    {
      "word": "preserve",
      "meaning": "保存する、保持する",
      "example_sentences": [
        {
          "en": "To preserve the details, render the image at a higher resolution.",
          "ja": "詳細を保持するために、より高い解像度で画像をレンダリングしてください。"
        },
        {
          "en": "It's essential to preserve the original file structure when exporting assets.",
          "ja": "アセットをエクスポートする際には、元のファイル構造を保存することが重要です。"
        }
      ]
    },
    {
      "word": "thus",
      "meaning": "したがって、その結果",
      "example_sentences": [
        {
          "en": "The scene was optimized, thus reducing the render time significantly.",
          "ja": "シーンが最適化され、その結果レンダリング時間が大幅に短縮されました。"
        },
        {
          "en": "The model was rigged properly, thus allowing smooth animation.",
          "ja": "モデルが適切にリグされ、その結果、スムーズなアニメーションが可能になりました。"
        }
      ]
    },
    {
      "word": "usable",
      "meaning": "使える、実用的な",
      "example_sentences": [
        {
          "en": "The textures are usable across multiple projects due to their high quality.",
          "ja": "これらのテクスチャは高品質のため、複数のプロジェクトで使用可能です。"
        },
        {
          "en": "Ensure the 3D assets are usable in different game engines.",
          "ja": "3Dアセットが異なるゲームエンジンでも使用できることを確認してください。"
        }
      ]
    },
    {
      "word": "subsequent",
      "meaning": "後の、次に続く",
      "example_sentences": [
        {
          "en": "The subsequent updates improved the performance of the rendering engine.",
          "ja": "その後のアップデートにより、レンダリングエンジンの性能が向上しました。"
        },
        {
          "en": "Subsequent layers of the texture were added to enhance the final look.",
          "ja": "テクスチャの次のレイヤーが追加され、最終的な見た目が強化されました。"
        }
      ]
    },
    {
      "word": "separate",
      "meaning": "分ける、別の",
      "example_sentences": [
        {
          "en": "It's best to keep the lighting and materials in separate layers for better control.",
          "ja": "より良いコントロールのために、照明とマテリアルを別々のレイヤーに分けておくのが最善です。"
        },
        {
          "en": "You can separate the model into different parts to simplify the rigging process.",
          "ja": "リギングプロセスを簡略化するために、モデルを異なる部分に分けることができます。"
        }
      ]
    },
    {
      "word": "embark",
      "meaning": "乗り出す、開始する",
      "example_sentences": [
        {
          "en": "Before you embark on a large project, ensure all assets are properly organized.",
          "ja": "大規模なプロジェクトに乗り出す前に、すべてのアセットが適切に整理されていることを確認してください。"
        },
        {
          "en": "The team decided to embark on a new animation project that uses real-time rendering.",
          "ja": "チームは、リアルタイムレンダリングを使用した新しいアニメーションプロジェクトに乗り出すことを決定しました。"
        }
      ]
    },
    {
      "word": "objective",
      "meaning": "目標、目的",
      "example_sentences": [
        {
          "en": "The main objective of the project is to create a photorealistic environment.",
          "ja": "このプロジェクトの主な目的は、フォトリアルな環境を作り出すことです。"
        },
        {
          "en": "Define your objective clearly before starting the modeling process.",
          "ja": "モデリングプロセスを開始する前に、目的を明確に定義してください。"
        }
      ]
    }
  ]
}
