{
  "book": "wgpu-by-examples",
  "date": "2024-08-18",
  "words": [
    {
      "word": "furthermore",
      "meaning": "さらに、その上",
      "example_sentences": [
        {
          "en": "The new update improves rendering speed; furthermore, it enhances texture quality.",
          "ja": "新しいアップデートはレンダリング速度を向上させます。さらに、テクスチャの品質も向上させます。"
        },
        {
          "en": "The model was optimized for performance; furthermore, the polygon count was reduced.",
          "ja": "モデルはパフォーマンスのために最適化されました。さらに、ポリゴン数も削減されました。"
        }
      ]
    },
    {
      "word": "independently",
      "meaning": "独立して",
      "example_sentences": [
        {
          "en": "Each module of the software can be updated independently.",
          "ja": "ソフトウェアの各モジュールは、独立して更新することができます。"
        },
        {
          "en": "The lights and shadows are calculated independently from each other.",
          "ja": "ライトと影は互いに独立して計算されます。"
        }
      ]
    },
    {
      "word": "pass",
      "meaning": "通過する、パス（処理の一段階）",
      "example_sentences": [
        {
          "en": "The render engine completed the first pass, focusing on basic lighting.",
          "ja": "レンダーエンジンは、基本的な照明に焦点を当てた最初のパスを完了しました。"
        },
        {
          "en": "You can pass the data through a shader to modify its appearance.",
          "ja": "データをシェーダーに通して、その外観を変更することができます。"
        }
      ]
    },
    {
      "word": "closely",
      "meaning": "密接に、注意深く",
      "example_sentences": [
        {
          "en": "The artist worked closely with the director to achieve the desired look.",
          "ja": "アーティストは、希望する外観を実現するためにディレクターと密接に協力しました。"
        },
        {
          "en": "The two models resemble each other closely in terms of shape and size.",
          "ja": "2つのモデルは、形状とサイズにおいて密接に似ています。"
        }
      ]
    },
    {
      "word": "resemble",
      "meaning": "似ている、類似している",
      "example_sentences": [
        {
          "en": "The final render should closely resemble the concept art.",
          "ja": "最終レンダリングは、コンセプトアートに近似しているべきです。"
        },
        {
          "en": "The 3D model was designed to resemble the real-world object as closely as possible.",
          "ja": "その3Dモデルは、実際の物体にできるだけ近づけるように設計されました。"
        }
      ]
    },
    {
      "word": "exception",
      "meaning": "例外",
      "example_sentences": [
        {
          "en": "All textures were loaded correctly, with the exception of one missing file.",
          "ja": "1つの欠落したファイルを除いて、すべてのテクスチャが正しく読み込まれました。"
        },
        {
          "en": "The software works well on all platforms, with the exception of older hardware.",
          "ja": "古いハードウェアを除き、ソフトウェアはすべてのプラットフォームでうまく動作します。"
        }
      ]
    },
    {
      "word": "arise",
      "meaning": "発生する、生じる",
      "example_sentences": [
        {
          "en": "Problems may arise if the lighting setup is not configured correctly.",
          "ja": "照明設定が正しく構成されていないと、問題が発生する可能性があります。"
        },
        {
          "en": "New challenges arise with every iteration of the project.",
          "ja": "プロジェクトの各反復で、新たな課題が生じます。"
        }
      ]
    },
    {
      "word": "due",
      "meaning": "〜が原因で、〜による",
      "example_sentences": [
        {
          "en": "The delay was due to unexpected rendering errors.",
          "ja": "遅延は予期しないレンダリングエラーが原因でした。"
        },
        {
          "en": "The increase in render time was due to the high complexity of the scene.",
          "ja": "レンダリング時間の増加は、シーンの複雑さが原因でした。"
        }
      ]
    },
    {
      "word": "via",
      "meaning": "〜を通じて、〜経由で",
      "example_sentences": [
        {
          "en": "The texture was imported via a third-party plugin.",
          "ja": "テクスチャは、サードパーティ製プラグインを経由してインポートされました。"
        },
        {
          "en": "The data was transferred via a secure connection to ensure privacy.",
          "ja": "データはプライバシーを確保するために、安全な接続を通じて転送されました。"
        }
      ]
    },
    {
      "word": "incorporate",
      "meaning": "組み込む、取り入れる",
      "example_sentences": [
        {
          "en": "The new design incorporates elements from both the original and updated models.",
          "ja": "新しいデザインは、オリジナルモデルと更新されたモデルの両方の要素を取り入れています。"
        },
        {
          "en": "We plan to incorporate more realistic lighting effects in the next update.",
          "ja": "次回のアップデートでは、よりリアルな照明効果を取り入れる予定です。"
        }
      ]
    }
  ]
}
