{
  "book": "wgpu-by-examples",
  "date": "2024-08-18",
  "words": [
    {
      "word": "in such cases",
      "meaning": "そのような場合には",
      "example_sentences": [
        {
          "en": "In such cases, it's important to check the rendering settings.",
          "ja": "そのような場合には、レンダリング設定を確認することが重要です。"
        },
        {
          "en": "In such cases, you might need to adjust the light source to achieve the desired effect.",
          "ja": "そのような場合には、希望する効果を得るために光源を調整する必要があるかもしれません。"
        }
      ]
    },
    {
      "word": "specifically",
      "meaning": "具体的に",
      "example_sentences": [
        {
          "en": "This shader was specifically designed for realistic skin rendering.",
          "ja": "このシェーダーは、リアルな肌のレンダリングのために具体的に設計されました。"
        },
        {
          "en": "We need to specifically address the issue with texture mapping.",
          "ja": "テクスチャマッピングの問題に具体的に対応する必要があります。"
        }
      ]
    },
    {
      "word": "involve",
      "meaning": "含む、関与する",
      "example_sentences": [
        {
          "en": "Creating a realistic 3D model can involve complex algorithms.",
          "ja": "リアルな3Dモデルを作成することは、複雑なアルゴリズムを含むことがあります。"
        },
        {
          "en": "The project will involve both animators and technical artists.",
          "ja": "このプロジェクトには、アニメーターとテクニカルアーティストの両方が関与します。"
        }
      ]
    },
    {
      "word": "comparing",
      "meaning": "比較すること",
      "example_sentences": [
        {
          "en": "When comparing different render engines, consider both quality and speed.",
          "ja": "異なるレンダーエンジンを比較する際には、品質と速度の両方を考慮してください。"
        },
        {
          "en": "Comparing the two textures, you can see a significant difference in detail.",
          "ja": "二つのテクスチャを比較すると、ディテールに大きな違いが見られます。"
        }
      ]
    },
    {
      "word": "ensure",
      "meaning": "確実にする",
      "example_sentences": [
        {
          "en": "Ensure that all assets are properly optimized before rendering.",
          "ja": "レンダリング前に、すべてのアセットが適切に最適化されていることを確実にしてください。"
        },
        {
          "en": "To ensure smooth playback, reduce the polygon count in the scene.",
          "ja": "スムーズな再生を確実にするために、シーン内のポリゴン数を減らしてください。"
        }
      ]
    },
    {
      "word": "proper",
      "meaning": "適切な",
      "example_sentences": [
        {
          "en": "Proper lighting is crucial for achieving realistic scenes.",
          "ja": "適切な照明は、リアルなシーンを実現するために重要です。"
        },
        {
          "en": "Make sure to use proper naming conventions for all files.",
          "ja": "すべてのファイルに適切な命名規則を使用するようにしてください。"
        }
      ]
    },
    {
      "word": "prevent",
      "meaning": "防ぐ",
      "example_sentences": [
        {
          "en": "To prevent artifacts, increase the sample count in your render settings.",
          "ja": "アーティファクトを防ぐために、レンダリング設定でサンプル数を増やしてください。"
        },
        {
          "en": "Use constraints to prevent the object from moving outside the desired area.",
          "ja": "オブジェクトが希望する範囲外に移動するのを防ぐために、拘束を使用してください。"
        }
      ]
    },
    {
      "word": "farther away from",
      "meaning": "〜からさらに遠くに",
      "example_sentences": [
        {
          "en": "Move the camera farther away from the subject to capture a wider scene.",
          "ja": "より広いシーンを撮影するために、カメラを被写体からさらに遠ざけてください。"
        },
        {
          "en": "As the object gets farther away from the light source, the shadows become softer.",
          "ja": "オブジェクトが光源からさらに遠くなると、影が柔らかくなります。"
        }
      ]
    },
    {
      "word": "correctly",
      "meaning": "正しく",
      "example_sentences": [
        {
          "en": "Make sure the materials are applied correctly to each mesh.",
          "ja": "各メッシュにマテリアルが正しく適用されていることを確認してください。"
        },
        {
          "en": "If the rig isn't set up correctly, the animation will not play smoothly.",
          "ja": "リグが正しく設定されていない場合、アニメーションはスムーズに再生されません。"
        }
      ]
    },
    {
      "word": "spatial",
      "meaning": "空間の",
      "example_sentences": [
        {
          "en": "Understanding spatial relationships is key in 3D modeling.",
          "ja": "3Dモデリングでは空間の関係を理解することが重要です。"
        },
        {
          "en": "Spatial awareness helps in positioning objects accurately in the scene.",
          "ja": "空間認識は、シーン内でオブジェクトを正確に配置するのに役立ちます。"
        }
      ]
    }
  ]
}
