{
  "book": "wgpu-by-examples",
  "date": "2024-08-18",
  "words": [
    {
      "word": "latitude",
      "meaning": "緯度",
      "example_sentences": [
        {
          "en": "In the spherical coordinate system, latitude is the angle above or below the equator.",
          "ja": "球面座標系では、緯度は赤道の上または下の角度です。"
        },
        {
          "en": "The model's texture was adjusted according to its latitude and longitude to fit the spherical surface.",
          "ja": "モデルのテクスチャは、球面に合わせるために緯度と経度に従って調整されました。"
        }
      ]
    },
    {
      "word": "divide",
      "meaning": "分割する、分ける",
      "example_sentences": [
        {
          "en": "You can divide the mesh into smaller sections to optimize the rendering process.",
          "ja": "メッシュを小さなセクションに分割して、レンダリングプロセスを最適化することができます。"
        },
        {
          "en": "The scene was divided into multiple layers to simplify the editing process.",
          "ja": "シーンは、編集プロセスを簡略化するために複数のレイヤーに分割されました。"
        }
      ]
    },
    {
      "word": "review",
      "meaning": "見直す、レビューする",
      "example_sentences": [
        {
          "en": "The team will review the final render to ensure all elements are correct.",
          "ja": "チームは、すべての要素が正しいことを確認するために最終レンダリングを見直します。"
        },
        {
          "en": "Before submission, it's essential to review the project files for any errors.",
          "ja": "提出前に、エラーがないかプロジェクトファイルを見直すことが不可欠です。"
        }
      ]
    },
    {
      "word": "discourse",
      "meaning": "議論、論説",
      "example_sentences": [
        {
          "en": "The team engaged in a discourse on how to improve the animation workflow.",
          "ja": "チームはアニメーションワークフローを改善する方法について議論を交わしました。"
        },
        {
          "en": "The discourse surrounding the new rendering technique focused on its potential benefits and drawbacks.",
          "ja": "新しいレンダリング技術に関する議論は、その潜在的な利点と欠点に焦点を当てていました。"
        }
      ]
    },
    {
      "word": "account",
      "meaning": "説明、考慮",
      "example_sentences": [
        {
          "en": "The lighting setup must take into account the position of all objects in the scene.",
          "ja": "照明設定は、シーン内のすべてのオブジェクトの位置を考慮する必要があります。"
        },
        {
          "en": "The software's performance issues were taken into account during the optimization process.",
          "ja": "ソフトウェアのパフォーマンスの問題は、最適化プロセスで考慮されました。"
        }
      ]
    },
    {
      "word": "namely",
      "meaning": "すなわち、具体的には",
      "example_sentences": [
        {
          "en": "The software supports multiple file formats, namely OBJ, FBX, and STL.",
          "ja": "このソフトウェアは、OBJ、FBX、およびSTLという複数のファイル形式をサポートしています。"
        },
        {
          "en": "Three main issues were identified, namely rendering speed, memory usage, and compatibility.",
          "ja": "3つの主要な問題が特定されました。すなわち、レンダリング速度、メモリ使用量、および互換性です。"
        }
      ]
    },
    {
      "word": "remain",
      "meaning": "残る、留まる",
      "example_sentences": [
        {
          "en": "Despite the optimizations, some issues remain unresolved.",
          "ja": "最適化にもかかわらず、いくつかの問題は未解決のままです。"
        },
        {
          "en": "The object's position will remain unchanged throughout the animation.",
          "ja": "オブジェクトの位置は、アニメーション全体を通して変更されないままです。"
        }
      ]
    },
    {
      "word": "omit",
      "meaning": "省略する、除外する",
      "example_sentences": [
        {
          "en": "You can omit unnecessary details to speed up the rendering process.",
          "ja": "レンダリングプロセスを高速化するために、不要な詳細を省略できます。"
        },
        {
          "en": "The background was intentionally omitted to focus on the main subject.",
          "ja": "メインの被写体に焦点を当てるために、背景は意図的に省略されました。"
        }
      ]
    },
    {
      "word": "identical",
      "meaning": "同一の、全く同じ",
      "example_sentences": [
        {
          "en": "The two models are identical in shape but differ in texture.",
          "ja": "2つのモデルは形状が同一ですが、テクスチャが異なります。"
        },
        {
          "en": "The settings for both scenes are identical to ensure consistency in rendering.",
          "ja": "レンダリングの一貫性を確保するために、両方のシーンの設定は同一です。"
        }
      ]
    },
    {
      "word": "brevity",
      "meaning": "簡潔さ",
      "example_sentences": [
        {
          "en": "The tutorial is designed for brevity, focusing only on the essential steps.",
          "ja": "チュートリアルは簡潔さを重視して設計されており、必要なステップのみに焦点を当てています。"
        },
        {
          "en": "For the sake of brevity, some details were omitted from the final report.",
          "ja": "簡潔さを保つために、いくつかの詳細は最終報告書から省略されました。"
        }
      ]
    }
  ]
}
