{
  "book": "wgpu-by-examples",
  "date": "2024-08-19",
  "words": [
    {
      "word": "overall",
      "meaning": "全体的に、総合的に",
      "example_sentences": [
        {
          "en": "The overall design of the scene was praised for its attention to detail.",
          "ja": "シーンの全体的なデザインは、細部へのこだわりが評価されました。"
        },
        {
          "en": "The changes made to the texture improved the overall quality of the render.",
          "ja": "テクスチャに加えられた変更により、レンダリングの全体的な品質が向上しました。"
        }
      ]
    },
    {
      "word": "displacement",
      "meaning": "変位、ディスプレイスメント",
      "example_sentences": [
        {
          "en": "The displacement map was used to add realistic surface details to the model.",
          "ja": "ディスプレイスメントマップを使用して、モデルにリアルな表面のディテールを追加しました。"
        },
        {
          "en": "Displacement allows for the modification of geometry based on texture information.",
          "ja": "ディスプレイスメントにより、テクスチャ情報に基づいてジオメトリを変更することができます。"
        }
      ]
    },
    {
      "word": "ensures",
      "meaning": "確実にする、保証する",
      "example_sentences": [
        {
          "en": "Using high-quality assets ensures that the final render will look professional.",
          "ja": "高品質のアセットを使用することで、最終レンダリングがプロフェッショナルに見えることを保証します。"
        },
        {
          "en": "The new lighting setup ensures that all areas of the scene are properly illuminated.",
          "ja": "新しい照明設定により、シーンのすべてのエリアが適切に照らされることが確実になります。"
        }
      ]
    },
    {
      "word": "perpendicular",
      "meaning": "垂直の、直角の",
      "example_sentences": [
        {
          "en": "The camera was positioned perpendicular to the object to capture a front view.",
          "ja": "カメラは正面ビューをキャプチャするために、オブジェクトに対して垂直に配置されました。"
        },
        {
          "en": "The walls were aligned perpendicular to the floor to maintain architectural accuracy.",
          "ja": "建築精度を維持するために、壁は床に対して垂直に配置されました。"
        }
      ]
    },
    {
      "word": "convey",
      "meaning": "伝える、伝達する",
      "example_sentences": [
        {
          "en": "The animation effectively conveys the movement and emotion of the character.",
          "ja": "アニメーションは、キャラクターの動きと感情を効果的に伝えています。"
        },
        {
          "en": "Lighting and color were used to convey a sense of mystery in the scene.",
          "ja": "シーンに神秘感を伝えるために、照明と色が使用されました。"
        }
      ]
    },
    {
      "word": "critical",
      "meaning": "重要な、決定的な",
      "example_sentences": [
        {
          "en": "Proper lighting is critical for achieving realistic renders.",
          "ja": "適切な照明は、リアルなレンダリングを達成するために重要です。"
        },
        {
          "en": "The shader settings play a critical role in determining the final appearance of the material.",
          "ja": "シェーダー設定は、マテリアルの最終的な外観を決定する上で重要な役割を果たします。"
        }
      ]
    },
    {
      "word": "factor",
      "meaning": "要因、因子",
      "example_sentences": [
        {
          "en": "Render time is a critical factor to consider when working with complex scenes.",
          "ja": "複雑なシーンを扱う際には、レンダリング時間が重要な要因です。"
        },
        {
          "en": "The polygon count is an important factor that affects the performance of 3D models.",
          "ja": "ポリゴン数は、3Dモデルのパフォーマンスに影響を与える重要な要因です。"
        }
      ]
    },
    {
      "word": "not offer",
      "meaning": "提供しない、提供しません",
      "example_sentences": [
        {
          "en": "The basic version of the software does not offer advanced rendering features.",
          "ja": "ソフトウェアの基本バージョンでは、高度なレンダリング機能は提供されていません。"
        },
        {
          "en": "This material does not offer the same level of detail as the high-resolution version.",
          "ja": "このマテリアルは、高解像度バージョンと同じレベルの詳細を提供しません。"
        }
      ]
    },
    {
      "word": "expect",
      "meaning": "予期する、期待する",
      "example_sentences": [
        {
          "en": "We expect the rendering process to take several hours due to the complexity of the scene.",
          "ja": "シーンの複雑さから、レンダリングプロセスには数時間かかると予想しています。"
        },
        {
          "en": "The client expects the final render to closely match the original concept art.",
          "ja": "クライアントは、最終レンダリングがオリジナルのコンセプトアートに近いものになることを期待しています。"
        }
      ]
    },
    {
      "word": "explore",
      "meaning": "探る、探索する",
      "example_sentences": [
        {
          "en": "The team decided to explore different lighting techniques to enhance the scene's realism.",
          "ja": "チームは、シーンのリアリズムを高めるためにさまざまな照明技術を探ることにしました。"
        },
        {
          "en": "We need to explore alternative methods to optimize the render time.",
          "ja": "レンダリング時間を最適化するために代替方法を探る必要があります。"
        }
      ]
    }
  ]
}
