{
  "book": "compute-webgpu",
  "date": "2024-08-22",
  "words": [
    {
      "word": "refer",
      "meaning": "参照する、言及する",
      "example_sentences": [
        {
          "en": "Please refer to the documentation for detailed instructions on installation.",
          "ja": "インストールの詳細な手順については、ドキュメントを参照してください。"
        },
        {
          "en": "He referred to the previous project as an example of best practices.",
          "ja": "彼はベストプラクティスの例として、前のプロジェクトに言及しました。"
        }
      ]
    },
    {
      "word": "cause",
      "meaning": "引き起こす、原因となる",
      "example_sentences": [
        {
          "en": "The incorrect shader settings caused the rendering error.",
          "ja": "誤ったシェーダー設定がレンダリングエラーを引き起こしました。"
        },
        {
          "en": "The delay was caused by a lack of resources during the simulation.",
          "ja": "遅延はシミュレーション中のリソース不足によって引き起こされました。"
        }
      ]
    },
    {
      "word": "simplified",
      "meaning": "簡略化された、単純化された",
      "example_sentences": [
        {
          "en": "The simplified user interface makes the software easier to use for beginners.",
          "ja": "簡略化されたユーザーインターフェースにより、初心者でもソフトウェアを使いやすくなっています。"
        },
        {
          "en": "We introduced a simplified version of the algorithm to reduce processing time.",
          "ja": "処理時間を短縮するために、アルゴリズムの簡略化バージョンを導入しました。"
        }
      ]
    },
    {
      "word": "stalling",
      "meaning": "停滞、行き詰まり",
      "example_sentences": [
        {
          "en": "The rendering process kept stalling due to insufficient memory.",
          "ja": "レンダリングプロセスは、メモリ不足のために停滞し続けました。"
        },
        {
          "en": "We need to find out what’s causing the stalling in the simulation.",
          "ja": "シミュレーションが停滞している原因を突き止める必要があります。"
        }
      ]
    },
    {
      "word": "considerably",
      "meaning": "かなり、相当に",
      "example_sentences": [
        {
          "en": "The new update considerably improved the software's performance.",
          "ja": "新しいアップデートは、ソフトウェアのパフォーマンスをかなり向上させました。"
        },
        {
          "en": "The render times were reduced considerably after optimizing the code.",
          "ja": "コードを最適化した後、レンダリング時間がかなり短縮されました。"
        }
      ]
    },
    {
      "word": "even",
      "meaning": "～さえも、さらに",
      "example_sentences": [
        {
          "en": "Even the most complex scenes rendered faster with the new engine.",
          "ja": "最も複雑なシーンでさえ、新しいエンジンを使うとより速くレンダリングされました。"
        },
        {
          "en": "The new feature works well even on older hardware.",
          "ja": "新機能は、古いハードウェアでも問題なく動作します。"
        }
      ]
    },
    {
      "word": "coupled",
      "meaning": "結びついた、組み合わされた",
      "example_sentences": [
        {
          "en": "High performance, coupled with ease of use, makes this tool popular among developers.",
          "ja": "高性能と使いやすさが結びついて、このツールは開発者の間で人気があります。"
        },
        {
          "en": "The powerful GPU, coupled with optimized code, significantly improved the render times.",
          "ja": "強力なGPUと最適化されたコードが結びついて、レンダリング時間が大幅に改善されました。"
        }
      ]
    },
    {
      "word": "efficiency",
      "meaning": "効率、能率",
      "example_sentences": [
        {
          "en": "Improving the efficiency of the rendering pipeline is our top priority.",
          "ja": "レンダリングパイプラインの効率を改善することが私たちの最優先事項です。"
        },
        {
          "en": "The new algorithm greatly enhances the efficiency of data processing.",
          "ja": "新しいアルゴリズムは、データ処理の効率を大幅に向上させます。"
        }
      ]
    },
    {
      "word": "man of",
      "meaning": "～の人、～の人物",
      "example_sentences": [
        {
          "en": "He is a man of many talents, especially in 3D modeling and animation.",
          "ja": "彼は多才な人物で、特に3Dモデリングとアニメーションに秀でています。"
        },
        {
          "en": "As a man of principles, he always ensures the quality of his work.",
          "ja": "彼は信念の人で、常に自分の仕事の品質を保証します。"
        }
      ]
    },
    {
      "word": "gous",
      "meaning": "（未定義の言葉）",
      "example_sentences": [
        {
          "en": "The term 'gous' doesn't seem to correspond to any recognized English word.",
          "ja": "「gous」という用語は、既知の英語の単語には該当しないようです。"
        },
        {
          "en": "We might need to clarify what 'gous' refers to in this context.",
          "ja": "この文脈で「gous」が何を指しているのか明確にする必要があるかもしれません。"
        }
      ]
    }
  ]
}
