{
  "book": "wgpu-by-examples",
  "date": "2024-08-19",
  "words": [
    {
      "word": "reflector",
      "meaning": "反射板、リフレクター",
      "example_sentences": [
        {
          "en": "The reflector was positioned to bounce light onto the subject from a different angle.",
          "ja": "リフレクターは、異なる角度から被写体に光を当てるために配置されました。"
        },
        {
          "en": "Using a reflector can help fill in shadows and create a more balanced lighting setup.",
          "ja": "リフレクターを使用すると、影を埋め、よりバランスの取れた照明設定を作成するのに役立ちます。"
        }
      ]
    },
    {
      "word": "scatter",
      "meaning": "散乱させる、ばらまく",
      "example_sentences": [
        {
          "en": "The particles were set to scatter light, creating a soft glow effect in the scene.",
          "ja": "粒子は光を散乱させるように設定され、シーンに柔らかな光輝効果を作り出しました。"
        },
        {
          "en": "Light will scatter differently depending on the surface material and its texture.",
          "ja": "光は、表面のマテリアルとそのテクスチャに応じて異なる散乱を示します。"
        }
      ]
    },
    {
      "word": "shiny",
      "meaning": "光沢のある、輝く",
      "example_sentences": [
        {
          "en": "The car model was given a shiny finish to emphasize its sleek design.",
          "ja": "車のモデルには、洗練されたデザインを強調するために光沢のある仕上げが施されました。"
        },
        {
          "en": "A shiny surface reflects light more directly, creating bright highlights.",
          "ja": "光沢のある表面は光をより直接的に反射し、明るいハイライトを作り出します。"
        }
      ]
    },
    {
      "word": "glossiness",
      "meaning": "光沢、つや",
      "example_sentences": [
        {
          "en": "The glossiness of the material was adjusted to make the object appear more reflective.",
          "ja": "オブジェクトがより反射性を持つように、マテリアルの光沢が調整されました。"
        },
        {
          "en": "High glossiness values result in sharper reflections on the surface.",
          "ja": "高い光沢値は、表面に鋭い反射をもたらします。"
        }
      ]
    },
    {
      "word": "narrow",
      "meaning": "狭い、細い",
      "example_sentences": [
        {
          "en": "The camera's field of view was narrowed to focus on the central object.",
          "ja": "カメラの視野が狭められ、中央のオブジェクトに焦点が当てられました。"
        },
        {
          "en": "A narrow beam of light was used to highlight the details of the model.",
          "ja": "モデルの詳細を強調するために、細い光の束が使用されました。"
        }
      ]
    },
    {
      "word": "emerge",
      "meaning": "現れる、出現する",
      "example_sentences": [
        {
          "en": "As the lighting was adjusted, new details began to emerge in the shadows.",
          "ja": "照明が調整されると、影の中から新しいディテールが現れ始めました。"
        },
        {
          "en": "The true shape of the object emerged after the texture was applied.",
          "ja": "テクスチャが適用された後、オブジェクトの真の形状が現れました。"
        }
      ]
    },
    {
      "word": "impact of",
      "meaning": "〜の影響、〜の効果",
      "example_sentences": [
        {
          "en": "The impact of lighting on the scene's mood cannot be overstated.",
          "ja": "シーンのムードに対する照明の影響は計り知れません。"
        },
        {
          "en": "We need to consider the impact of increasing the polygon count on rendering times.",
          "ja": "レンダリング時間に対するポリゴン数の増加の影響を考慮する必要があります。"
        }
      ]
    },
    {
      "word": "crucial",
      "meaning": "非常に重要な、決定的な",
      "example_sentences": [
        {
          "en": "Proper texture mapping is crucial for achieving a realistic look.",
          "ja": "リアルな見た目を実現するためには、適切なテクスチャマッピングが非常に重要です。"
        },
        {
          "en": "Accurate lighting is crucial in creating depth and dimension in the scene.",
          "ja": "シーンに深さと次元を作り出すには、正確な照明が非常に重要です。"
        }
      ]
    },
    {
      "word": "facing",
      "meaning": "〜に面している、〜を向いている",
      "example_sentences": [
        {
          "en": "The model's front side was facing the light source to create a dramatic effect.",
          "ja": "モデルの正面は劇的な効果を生み出すために光源に面していました。"
        },
        {
          "en": "Ensure the object is facing the camera to capture the intended perspective.",
          "ja": "オブジェクトが意図した視点をキャプチャできるように、カメラに向いていることを確認してください。"
        }
      ]
    },
    {
      "word": "general",
      "meaning": "一般的な、全体的な",
      "example_sentences": [
        {
          "en": "The general approach to 3D modeling involves creating a base mesh before adding details.",
          "ja": "3Dモデリングの一般的なアプローチは、詳細を追加する前にベースメッシュを作成することです。"
        },
        {
          "en": "The general lighting setup provides even illumination across the entire scene.",
          "ja": "一般的な照明設定では、シーン全体に均等な照明が提供されます。"
        }
      ]
    }
  ]
}
