{
  "book": "wgpu-by-examples",
  "date": "2024-08-19",
  "words": [
    {
      "word": "representation",
      "meaning": "表現、表現方法",
      "example_sentences": [
        {
          "en": "The 3D model is a detailed representation of the original concept art.",
          "ja": "この3Dモデルは、オリジナルのコンセプトアートを詳細に表現したものです。"
        },
        {
          "en": "Different types of shading provide various representations of how light interacts with surfaces.",
          "ja": "異なる種類のシェーディングにより、光が表面とどのように相互作用するかが様々に表現されます。"
        }
      ]
    },
    {
      "word": "towards",
      "meaning": "〜に向かって、〜の方へ",
      "example_sentences": [
        {
          "en": "The light source was moved towards the center of the scene to create balanced lighting.",
          "ja": "バランスの取れた照明を作り出すために、光源がシーンの中央に向かって移動されました。"
        },
        {
          "en": "The character is walking towards the camera, creating a sense of depth.",
          "ja": "キャラクターはカメラに向かって歩いており、奥行き感を生み出しています。"
        }
      ]
    },
    {
      "word": "raise",
      "meaning": "上げる、引き上げる",
      "example_sentences": [
        {
          "en": "Raising the light intensity will make the scene brighter and more vibrant.",
          "ja": "光の強度を上げると、シーンがより明るく、活気に満ちたものになります。"
        },
        {
          "en": "You can raise the camera angle to get a better view of the entire model.",
          "ja": "カメラの角度を上げると、モデル全体をより良く見渡せます。"
        }
      ]
    },
    {
      "word": "exponent",
      "meaning": "指数、乗数",
      "example_sentences": [
        {
          "en": "The exponent value in the shader controls the sharpness of the specular highlight.",
          "ja": "シェーダーの指数値は、スペキュラーハイライトの鋭さを制御します。"
        },
        {
          "en": "A higher exponent results in a smaller, sharper highlight on shiny surfaces.",
          "ja": "指数が高いと、光沢のある表面に小さく鋭いハイライトが生じます。"
        }
      ]
    },
    {
      "word": "shininess",
      "meaning": "光沢、つや",
      "example_sentences": [
        {
          "en": "Adjusting the shininess value will change how reflective the material appears.",
          "ja": "光沢値を調整すると、マテリアルの反射具合が変わります。"
        },
        {
          "en": "High shininess creates a polished, reflective surface, ideal for metals.",
          "ja": "高い光沢は、金属に適した研磨された反射面を作り出します。"
        }
      ]
    },
    {
      "word": "roughness",
      "meaning": "粗さ、ラフネス",
      "example_sentences": [
        {
          "en": "Increasing the roughness of the material gives it a more matte, less reflective appearance.",
          "ja": "マテリアルの粗さを増すことで、よりマットで反射の少ない外観になります。"
        },
        {
          "en": "The roughness map controls how light is scattered across the surface.",
          "ja": "ラフネスマップは、光が表面にどのように散乱するかを制御します。"
        }
      ]
    },
    {
      "word": "rougher",
      "meaning": "より粗い、よりざらざらした",
      "example_sentences": [
        {
          "en": "A rougher texture gives the object a more rugged, natural appearance.",
          "ja": "より粗いテクスチャは、オブジェクトにより素朴で自然な外観を与えます。"
        },
        {
          "en": "The surface became rougher after adjusting the roughness parameter in the shader.",
          "ja": "シェーダーのラフネスパラメータを調整した後、表面がより粗くなりました。"
        }
      ]
    },
    {
      "word": "appearance",
      "meaning": "外観、見た目",
      "example_sentences": [
        {
          "en": "The material's appearance was altered to make it look more like real wood.",
          "ja": "マテリアルの外観を変更して、より本物の木材に見えるようにしました。"
        },
        {
          "en": "Lighting plays a crucial role in the overall appearance of a 3D scene.",
          "ja": "照明は、3Dシーン全体の外観において重要な役割を果たします。"
        }
      ]
    },
    {
      "word": "shinier",
      "meaning": "より光沢のある、より輝く",
      "example_sentences": [
        {
          "en": "The car's surface was made shinier to better reflect the environment.",
          "ja": "車の表面をより光沢のあるものにして、環境をより反射するようにしました。"
        },
        {
          "en": "Increasing the glossiness value will make the object appear shinier.",
          "ja": "光沢値を上げると、オブジェクトがより光沢のあるものに見えます。"
        }
      ]
    },
    {
      "word": "brightness",
      "meaning": "明るさ、輝度",
      "example_sentences": [
        {
          "en": "The brightness of the scene was adjusted to enhance the overall mood.",
          "ja": "シーンの明るさは、全体的なムードを高めるために調整されました。"
        },
        {
          "en": "Brightness settings can be modified to achieve the desired lighting effects.",
          "ja": "希望する照明効果を得るために、明るさの設定を変更することができます。"
        }
      ]
    }
  ]
}
