{
  "book": "wgpu-by-examples",
  "date": "2024-08-18",
  "words": [
    {
      "word": "series of",
      "meaning": "一連の、連続する",
      "example_sentences": [
        {
          "en": "The animation is created by playing a series of images in quick succession.",
          "ja": "アニメーションは、一連の画像を高速で連続再生することで作成されます。"
        },
        {
          "en": "A series of tests were conducted to ensure the render settings were correct.",
          "ja": "レンダリング設定が正しいことを確認するために、一連のテストが実施されました。"
        }
      ]
    },
    {
      "word": "properly",
      "meaning": "適切に、正しく",
      "example_sentences": [
        {
          "en": "Ensure the textures are properly aligned to avoid seams in the final render.",
          "ja": "最終レンダリングで継ぎ目ができないように、テクスチャが適切に揃っていることを確認してください。"
        },
        {
          "en": "The lighting needs to be properly set up to achieve realistic shadows.",
          "ja": "リアルな影を作るために、照明が適切に設定される必要があります。"
        }
      ]
    },
    {
      "word": "onto",
      "meaning": "〜の上に、〜へ",
      "example_sentences": [
        {
          "en": "Drag the texture onto the model to apply it instantly.",
          "ja": "テクスチャをモデルにドラッグして、即座に適用します。"
        },
        {
          "en": "The light was projected onto the surface to create the desired effect.",
          "ja": "希望する効果を生み出すために、光がその表面に投影されました。"
        }
      ]
    },
    {
      "word": "essential",
      "meaning": "不可欠な、非常に重要な",
      "example_sentences": [
        {
          "en": "Proper UV mapping is essential for achieving accurate textures.",
          "ja": "正確なテクスチャを得るためには、適切なUVマッピングが不可欠です。"
        },
        {
          "en": "It's essential to back up your work regularly to avoid data loss.",
          "ja": "データの損失を避けるために、作業を定期的にバックアップすることが不可欠です。"
        }
      ]
    },
    {
      "word": "illusion",
      "meaning": "錯覚、幻影",
      "example_sentences": [
        {
          "en": "The use of depth of field creates the illusion of distance in the scene.",
          "ja": "被写界深度を使用すると、シーンに距離の錯覚を作り出すことができます。"
        },
        {
          "en": "Lighting and shadows were carefully adjusted to create the illusion of realism.",
          "ja": "リアリズムの錯覚を生み出すために、照明と影が慎重に調整されました。"
        }
      ]
    },
    {
      "word": "typically",
      "meaning": "通常、一般的に",
      "example_sentences": [
        {
          "en": "3D models are typically composed of vertices, edges, and faces.",
          "ja": "3Dモデルは通常、頂点、エッジ、フェイスで構成されています。"
        },
        {
          "en": "Lighting setups typically include key, fill, and rim lights for a balanced effect.",
          "ja": "照明設定には、通常、バランスの取れた効果を得るためにキーライト、フィルライト、リムライトが含まれます。"
        }
      ]
    },
    {
      "word": "adjust",
      "meaning": "調整する",
      "example_sentences": [
        {
          "en": "You can adjust the brightness of the scene by changing the intensity of the lights.",
          "ja": "ライトの強度を変更することで、シーンの明るさを調整できます。"
        },
        {
          "en": "The model's position was adjusted to better fit the camera angle.",
          "ja": "モデルの位置は、カメラアングルにより合うように調整されました。"
        }
      ]
    },
    {
      "word": "orientation",
      "meaning": "向き、方向",
      "example_sentences": [
        {
          "en": "The orientation of the object was altered to match the perspective of the scene.",
          "ja": "オブジェクトの向きは、シーンの視点に合わせて変更されました。"
        },
        {
          "en": "Ensure the orientation of the model is correct before starting the animation.",
          "ja": "アニメーションを開始する前に、モデルの向きが正しいことを確認してください。"
        }
      ]
    },
    {
      "word": "entire",
      "meaning": "全体の、すべての",
      "example_sentences": [
        {
          "en": "The entire scene was re-rendered to fix the lighting issues.",
          "ja": "照明の問題を修正するために、シーン全体が再レンダリングされました。"
        },
        {
          "en": "The entire project was completed within the given deadline.",
          "ja": "プロジェクト全体が与えられた締め切り内に完了しました。"
        }
      ]
    },
    {
      "word": "responsible",
      "meaning": "責任がある、担当している",
      "example_sentences": [
        {
          "en": "The lead artist is responsible for the overall visual style of the project.",
          "ja": "リードアーティストは、プロジェクトの全体的なビジュアルスタイルに責任があります。"
        },
        {
          "en": "The rendering team is responsible for producing the final images.",
          "ja": "レンダリングチームは、最終画像の作成を担当しています。"
        }
      ]
    }
  ]
}
