{
  "book": "wgpu-by-examples",
  "date": "2024-08-18",
  "words": [
    {
      "word": "straightforward",
      "meaning": "簡単な、分かりやすい",
      "example_sentences": [
        {
          "en": "The process of applying textures in this software is straightforward.",
          "ja": "このソフトウェアでのテクスチャの適用プロセスは簡単です。"
        },
        {
          "en": "Setting up basic lighting in the scene is quite straightforward.",
          "ja": "シーンに基本的な照明を設定することは非常に分かりやすいです。"
        }
      ]
    },
    {
      "word": "distinct",
      "meaning": "明確に異なる、独特の",
      "example_sentences": [
        {
          "en": "Each layer in the composite has a distinct effect on the final image.",
          "ja": "合成内の各レイヤーは、最終的な画像に明確に異なる効果を与えます。"
        },
        {
          "en": "The two materials have distinct properties that make them suitable for different purposes.",
          "ja": "これらの二つのマテリアルは、異なる用途に適した明確に異なる特性を持っています。"
        }
      ]
    },
    {
      "word": "comprise",
      "meaning": "構成する、含む",
      "example_sentences": [
        {
          "en": "The 3D model comprises several different components, including textures and meshes.",
          "ja": "その3Dモデルは、テクスチャやメッシュを含むいくつかの異なるコンポーネントで構成されています。"
        },
        {
          "en": "The environment comprises various assets like trees, buildings, and vehicles.",
          "ja": "環境は、木々、建物、車両など、さまざまなアセットで構成されています。"
        }
      ]
    },
    {
      "word": "worth noting that ...",
      "meaning": "注目すべきは〜",
      "example_sentences": [
        {
          "en": "It's worth noting that the new update significantly improves render speed.",
          "ja": "注目すべきは、新しいアップデートがレンダリング速度を大幅に向上させることです。"
        },
        {
          "en": "Worth noting is that using higher resolutions can increase memory usage.",
          "ja": "注目すべきは、高解像度の使用がメモリ使用量を増加させる可能性があることです。"
        }
      ]
    },
    {
      "word": "employ",
      "meaning": "使用する、雇用する",
      "example_sentences": [
        {
          "en": "This technique employs ray tracing to achieve realistic lighting effects.",
          "ja": "この技術は、リアルな照明効果を得るためにレイトレーシングを使用しています。"
        },
        {
          "en": "The studio employs several animators who specialize in character design.",
          "ja": "このスタジオは、キャラクターデザインを専門とする複数のアニメーターを雇用しています。"
        }
      ]
    },
    {
      "word": "predeclare",
      "meaning": "事前に宣言する",
      "example_sentences": [
        {
          "en": "Make sure to predeclare any changes to the project scope before starting.",
          "ja": "開始前にプロジェクトの範囲に対する変更を事前に宣言してください。"
        },
        {
          "en": "The team was required to predeclare the use of any external assets.",
          "ja": "チームは、外部アセットの使用を事前に宣言する必要がありました。"
        }
      ]
    },
    {
      "word": "subsequently",
      "meaning": "その後、引き続いて",
      "example_sentences": [
        {
          "en": "The model was adjusted, and the texture was subsequently reapplied.",
          "ja": "モデルが調整され、その後テクスチャが再適用されました。"
        },
        {
          "en": "The team created the initial design and subsequently worked on the details.",
          "ja": "チームは初期デザインを作成し、その後詳細に取り組みました。"
        }
      ]
    },
    {
      "word": "respectively",
      "meaning": "それぞれ",
      "example_sentences": [
        {
          "en": "The red, green, and blue channels represent the color values, respectively.",
          "ja": "赤、緑、青のチャンネルは、それぞれの色の値を表しています。"
        },
        {
          "en": "The animation and rendering were completed by two different teams, respectively.",
          "ja": "アニメーションとレンダリングは、それぞれ異なる2つのチームによって完成されました。"
        }
      ]
    },
    {
      "word": "conversion",
      "meaning": "変換",
      "example_sentences": [
        {
          "en": "The software allows for easy conversion of 2D images into 3D models.",
          "ja": "このソフトウェアは、2D画像を3Dモデルに簡単に変換することができます。"
        },
        {
          "en": "Conversion from one file format to another can sometimes result in data loss.",
          "ja": "あるファイル形式から別の形式への変換は、データの損失を引き起こすことがあります。"
        }
      ]
    },
    {
      "word": "relatively",
      "meaning": "比較的",
      "example_sentences": [
        {
          "en": "The rendering process is relatively quick, considering the scene's complexity.",
          "ja": "シーンの複雑さを考えると、レンダリングプロセスは比較的速いです。"
        },
        {
          "en": "This shader is relatively easy to use, even for beginners.",
          "ja": "このシェーダーは、初心者にとっても比較的使いやすいです。"
        }
      ]
    }
  ]
}
