{
  "book": "wgpu-by-examples",
  "date": "2024-08-18",
  "words": [
    {
      "word": "take place",
      "meaning": "行われる、起こる",
      "example_sentences": [
        {
          "en": "The rendering process will take place overnight to ensure completion by morning.",
          "ja": "レンダリングプロセスは、朝までに完了するように夜間に行われます。"
        },
        {
          "en": "The meeting to discuss the new project will take place next week.",
          "ja": "新しいプロジェクトについて話し合う会議は来週行われます。"
        }
      ]
    },
    {
      "word": "derive",
      "meaning": "由来する、引き出す",
      "example_sentences": [
        {
          "en": "The texture color is derived from the underlying material properties.",
          "ja": "テクスチャの色は、基になるマテリアルの特性から引き出されています。"
        },
        {
          "en": "The algorithm derives the final output by processing multiple layers of data.",
          "ja": "アルゴリズムは、複数のデータ層を処理することで最終出力を引き出します。"
        }
      ]
    },
    {
      "word": "independent",
      "meaning": "独立した、別個の",
      "example_sentences": [
        {
          "en": "Each module in the software operates independently from the others.",
          "ja": "ソフトウェアの各モジュールは、他のモジュールとは独立して動作します。"
        },
        {
          "en": "The lighting system is independent of the rendering engine, allowing more flexibility.",
          "ja": "照明システムはレンダリングエンジンとは独立しており、より柔軟な操作が可能です。"
        }
      ]
    },
    {
      "word": "coprocessor",
      "meaning": "コプロセッサ（補助処理装置）",
      "example_sentences": [
        {
          "en": "The coprocessor handles complex mathematical calculations to assist the main CPU.",
          "ja": "コプロセッサは、メインCPUを支援するために複雑な数値計算を処理します。"
        },
        {
          "en": "In graphics rendering, a coprocessor can significantly improve performance.",
          "ja": "グラフィックレンダリングでは、コプロセッサがパフォーマンスを大幅に向上させることがあります。"
        }
      ]
    },
    {
      "word": "consequently",
      "meaning": "その結果、したがって",
      "example_sentences": [
        {
          "en": "The texture resolution was too low; consequently, the final render looked pixelated.",
          "ja": "テクスチャの解像度が低すぎたため、その結果、最終レンダリングがピクセル化して見えました。"
        },
        {
          "en": "The lighting was not set up correctly; consequently, the shadows appeared unnatural.",
          "ja": "照明が正しく設定されていなかったため、その結果、影が不自然に見えました。"
        }
      ]
    },
    {
      "word": "appropriate",
      "meaning": "適切な",
      "example_sentences": [
        {
          "en": "Choose the appropriate shader for the material to achieve realistic results.",
          "ja": "リアルな結果を得るために、マテリアルに適したシェーダーを選択してください。"
        },
        {
          "en": "It's important to use the appropriate file format when exporting models.",
          "ja": "モデルをエクスポートする際には、適切なファイル形式を使用することが重要です。"
        }
      ]
    },
    {
      "word": "demonstrating",
      "meaning": "実演する、示す",
      "example_sentences": [
        {
          "en": "The video was effective in demonstrating the new features of the software.",
          "ja": "そのビデオは、ソフトウェアの新機能を実演するのに効果的でした。"
        },
        {
          "en": "The team prepared a presentation demonstrating the benefits of the new workflow.",
          "ja": "チームは、新しいワークフローの利点を示すプレゼンテーションを準備しました。"
        }
      ]
    },
    {
      "word": "several",
      "meaning": "いくつかの、複数の",
      "example_sentences": [
        {
          "en": "Several layers of textures were applied to create the final look.",
          "ja": "最終的な見た目を作り出すために、いくつかのテクスチャレイヤーが適用されました。"
        },
        {
          "en": "The project involved several stages, from concept to final render.",
          "ja": "このプロジェクトは、コンセプトから最終レンダリングまでのいくつかの段階を含んでいました。"
        }
      ]
    },
    {
      "word": "instruction",
      "meaning": "指示、命令",
      "example_sentences": [
        {
          "en": "Follow the instruction manual carefully when setting up the rendering engine.",
          "ja": "レンダリングエンジンを設定する際には、指示マニュアルを注意深く確認してください。"
        },
        {
          "en": "Each step in the process requires precise instruction to avoid errors.",
          "ja": "プロセスの各ステップは、エラーを避けるために正確な指示が必要です。"
        }
      ]
    },
    {
      "word": "as well as",
      "meaning": "〜と同様に、さらに",
      "example_sentences": [
        {
          "en": "The update improves rendering speed as well as overall stability.",
          "ja": "このアップデートは、レンダリング速度と同様に全体的な安定性も向上させます。"
        },
        {
          "en": "The software supports 3D modeling as well as 2D animation.",
          "ja": "このソフトウェアは、3Dモデリングと同様に2Dアニメーションもサポートしています。"
        }
      ]
    }
  ]
}
