{
  "book": "wgpu-by-examples",
  "date": "2024-08-19",
  "words": [
    {
      "word": "transpose",
      "meaning": "入れ替える、転置する",
      "example_sentences": [
        {
          "en": "You can transpose the rows and columns of the matrix to achieve the desired transformation.",
          "ja": "希望する変換を実現するために、行列の行と列を入れ替えることができます。"
        },
        {
          "en": "In 3D graphics, it's sometimes necessary to transpose coordinates for correct alignment.",
          "ja": "3Dグラフィックスでは、正しい整列のために座標を入れ替える必要がある場合があります。"
        }
      ]
    },
    {
      "word": "challenging",
      "meaning": "難しい、挑戦的な",
      "example_sentences": [
        {
          "en": "Creating realistic water effects can be challenging due to the complex physics involved.",
          "ja": "複雑な物理法則が関わるため、リアルな水のエフェクトを作成することは難しい場合があります。"
        },
        {
          "en": "Animating realistic human movements is one of the most challenging tasks in 3D modeling.",
          "ja": "リアルな人間の動きをアニメーション化することは、3Dモデリングで最も難しい作業の1つです。"
        }
      ]
    },
    {
      "word": "instead",
      "meaning": "代わりに",
      "example_sentences": [
        {
          "en": "Instead of using a high-poly model, consider using a normal map for detail.",
          "ja": "高ポリモデルを使用する代わりに、ディテールのためにノーマルマップを使用することを検討してください。"
        },
        {
          "en": "Instead of increasing the light intensity, you could add more light sources.",
          "ja": "光の強度を上げる代わりに、光源を追加することができます。"
        }
      ]
    },
    {
      "word": "and then",
      "meaning": "そしてその後",
      "example_sentences": [
        {
          "en": "Apply the base texture, and then add the details using a bump map.",
          "ja": "ベーステクスチャを適用し、その後バンプマップを使用して詳細を追加します。"
        },
        {
          "en": "Render the scene at low resolution first, and then increase the resolution for the final output.",
          "ja": "最初にシーンを低解像度でレンダリングし、その後最終出力のために解像度を上げます。"
        }
      ]
    },
    {
      "word": "fortunately",
      "meaning": "幸運にも、運良く",
      "example_sentences": [
        {
          "en": "Fortunately, the rendering error was caught early, so it didn't delay the project.",
          "ja": "幸運にも、レンダリングエラーが早期に発見されたため、プロジェクトの遅延には繋がりませんでした。"
        },
        {
          "en": "The file was corrupted, but fortunately, we had a backup.",
          "ja": "ファイルが破損しましたが、幸運にもバックアップがありました。"
        }
      ]
    },
    {
      "word": "pass ... to",
      "meaning": "〜に渡す、引き渡す",
      "example_sentences": [
        {
          "en": "You need to pass the texture coordinates to the shader for proper mapping.",
          "ja": "適切なマッピングを行うために、テクスチャ座標をシェーダーに渡す必要があります。"
        },
        {
          "en": "The data is passed to the rendering engine for final processing.",
          "ja": "データは最終処理のためにレンダリングエンジンに渡されます。"
        }
      ]
    },
    {
      "word": "account for",
      "meaning": "考慮する、説明する",
      "example_sentences": [
        {
          "en": "When calculating the final color, the shader must account for the lighting and texture.",
          "ja": "最終的な色を計算する際、シェーダーは照明とテクスチャを考慮しなければなりません。"
        },
        {
          "en": "The difference in render times can be accounted for by the increased complexity of the scene.",
          "ja": "レンダリング時間の違いは、シーンの複雑さが増したことによって説明できます。"
        }
      ]
    },
    {
      "word": "to increase",
      "meaning": "増加させるために",
      "example_sentences": [
        {
          "en": "To increase the realism of the scene, additional light sources were added.",
          "ja": "シーンのリアリズムを高めるために、追加の光源が追加されました。"
        },
        {
          "en": "The resolution was increased to achieve a sharper and clearer image.",
          "ja": "より鮮明でクリアな画像を得るために、解像度が上げられました。"
        }
      ]
    },
    {
      "word": "reusability",
      "meaning": "再利用性",
      "example_sentences": [
        {
          "en": "The script was designed with reusability in mind, allowing it to be used in multiple projects.",
          "ja": "スクリプトは再利用性を念頭に置いて設計されており、複数のプロジェクトで使用できます。"
        },
        {
          "en": "Modular design improves the reusability of components across different scenes.",
          "ja": "モジュール化されたデザインは、異なるシーンでのコンポーネントの再利用性を向上させます。"
        }
      ]
    },
    {
      "word": "to begin",
      "meaning": "始めるために、まず",
      "example_sentences": [
        {
          "en": "To begin, make sure all necessary assets are imported into the project.",
          "ja": "まず、必要なすべてのアセットがプロジェクトにインポートされていることを確認してください。"
        },
        {
          "en": "To begin the process, select the area you want to edit and apply the desired effect.",
          "ja": "プロセスを開始するには、編集したいエリアを選択し、希望するエフェクトを適用します。"
        }
      ]
    }
  ]
}
