{
  "book": "compute-webgpu",
  "chapter": "2.1",
  "words": [
    {
      "en": "landscape",
      "ja": "風景、状況、分野",
      "example_sentences": [
        {
          "en": "The 3D model of the landscape was created to represent a realistic outdoor environment.",
          "ja": "その風景の3Dモデルは、リアルな屋外環境を表現するために作成されました。"
        },
        {
          "en": "The software industry landscape has changed significantly with the introduction of new technologies.",
          "ja": "新技術の導入により、ソフトウェア業界の状況は大きく変わりました。"
        }
      ]
    },
    {
      "en": "significantly",
      "ja": "著しく、大幅に",
      "example_sentences": [
        {
          "en": "The rendering speed was significantly improved in the latest update.",
          "ja": "最新のアップデートでレンダリング速度が著しく向上しました。"
        },
        {
          "en": "Adding more light sources can significantly enhance the realism of the scene.",
          "ja": "光源を追加することで、シーンのリアリズムを大幅に向上させることができます。"
        }
      ]
    },
    {
      "en": "evolve",
      "ja": "進化する、発展する",
      "example_sentences": [
        {
          "en": "The software has evolved over time, adding more features with each version.",
          "ja": "このソフトウェアは、各バージョンでさらに多くの機能が追加されることで進化してきました。"
        },
        {
          "en": "3D modeling techniques continue to evolve as technology advances.",
          "ja": "3Dモデリング技術は、技術の進歩とともに進化し続けています。"
        }
      ]
    },
    {
      "en": "introduction",
      "ja": "導入、紹介",
      "example_sentences": [
        {
          "en": "The introduction of ray tracing has transformed the way realistic lighting is achieved.",
          "ja": "レイトレーシングの導入により、リアルな照明の実現方法が変わりました。"
        },
        {
          "en": "The introduction of new tools made the workflow more efficient.",
          "ja": "新しいツールの導入により、ワークフローがより効率的になりました。"
        }
      ]
    },
    {
      "en": "successor",
      "ja": "後継者、後継機",
      "example_sentences": [
        {
          "en": "The new software is the successor to the older, less advanced version.",
          "ja": "この新しいソフトウェアは、古くて機能が少ないバージョンの後継機です。"
        },
        {
          "en": "The successor model includes many improvements over its predecessor.",
          "ja": "後継モデルには、前モデルに対する多くの改良が含まれています。"
        }
      ]
    },
    {
      "en": "offer",
      "ja": "提供する、提示する",
      "example_sentences": [
        {
          "en": "The software offers a wide range of features for both beginners and professionals.",
          "ja": "このソフトウェアは、初心者からプロフェッショナルまで幅広い機能を提供します。"
        },
        {
          "en": "The new rendering engine offers better performance and more realistic lighting.",
          "ja": "新しいレンダリングエンジンは、より良いパフォーマンスとリアルな照明を提供します。"
        }
      ]
    },
    {
      "en": "enhance",
      "ja": "強化する、向上させる",
      "example_sentences": [
        {
          "en": "The texture was enhanced to make the surface details more prominent.",
          "ja": "テクスチャが強化され、表面のディテールがより目立つようになりました。"
        },
        {
          "en": "Post-processing effects can enhance the visual quality of the final render.",
          "ja": "ポストプロセッシング効果は、最終レンダリングの視覚品質を向上させることができます。"
        }
      ]
    },
    {
      "en": "sophisticate",
      "ja": "洗練する、高度にする",
      "example_sentences": [
        {
          "en": "The graphics engine was further sophisticate to handle more complex scenes.",
          "ja": "グラフィックスエンジンは、より複雑なシーンを処理するためにさらに高度化されました。"
        },
        {
          "en": "The user interface was sophisticate to provide a more intuitive experience.",
          "ja": "ユーザーインターフェイスは、より直感的な体験を提供するために洗練されました。"
        }
      ]
    },
    {
      "en": "capability",
      "ja": "能力、性能",
      "example_sentences": [
        {
          "en": "The new software has the capability to render photorealistic images in real-time.",
          "ja": "新しいソフトウェアは、リアルタイムでフォトリアリスティックな画像をレンダリングする能力を持っています。"
        },
        {
          "en": "The GPU's processing capability is crucial for handling high-resolution textures.",
          "ja": "GPUの処理能力は、高解像度テクスチャを処理するために重要です。"
        }
      ]
    },
    {
      "en": "enabling",
      "ja": "可能にする、〜できるようにする",
      "example_sentences": [
        {
          "en": "The new plugin is enabling more complex animations to be created with ease.",
          "ja": "この新しいプラグインは、より複雑なアニメーションを簡単に作成できるようにしています。"
        },
        {
          "en": "Enabling GPU acceleration can significantly speed up the rendering process.",
          "ja": "GPUアクセラレーションを有効にすることで、レンダリングプロセスを大幅に高速化できます。"
        }
      ]
    },
    {
      "en": "leverage",
      "ja": "活用する、利用する",
      "example_sentences": [
        {
          "en": "The team was able to leverage the power of the new GPU to accelerate rendering times.",
          "ja": "チームは新しいGPUのパワーを活用して、レンダリング時間を短縮しました。"
        },
        {
          "en": "By leveraging existing assets, the project was completed ahead of schedule.",
          "ja": "既存のアセットを活用することで、プロジェクトは予定より早く完了しました。"
        }
      ]
    },
    {
      "en": "delve",
      "ja": "掘り下げて調査する、深く探る",
      "example_sentences": [
        {
          "en": "The developers delved into the code to identify the source of the rendering bug.",
          "ja": "開発者たちは、レンダリングバグの原因を特定するためにコードを掘り下げて調査しました。"
        },
        {
          "en": "To improve the lighting system, the team delved into advanced shading techniques.",
          "ja": "照明システムを改善するために、チームは高度なシェーディング技術を深く探りました。"
        }
      ]
    },
    {
      "en": "harnessed",
      "ja": "利用された、活用された",
      "example_sentences": [
        {
          "en": "The power of machine learning was harnessed to create more realistic animations.",
          "ja": "よりリアルなアニメーションを作成するために、機械学習の力が活用されました。"
        },
        {
          "en": "Renewable energy sources were harnessed to reduce the carbon footprint of the data center.",
          "ja": "データセンターのカーボンフットプリントを削減するために、再生可能エネルギー源が利用されました。"
        }
      ]
    }
  ]
}
